CSI API ETABS v1
cLineElm.GetProperty Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetProperty(
	string Name,
	ref string PropName,
	ref int ObjType,
	ref bool Var,
	ref double SVarRelStartLoc,
	ref double SVarTotalLength
)
Function GetProperty (
	Name As String,
	ByRef PropName As String,
	ByRef ObjType As Integer,
	ByRef Var As Boolean,
	ByRef SVarRelStartLoc As Double,
	ByRef SVarTotalLength As Double
) As Integer
Dim instance As cLineElm
Dim Name As String
Dim PropName As String
Dim ObjType As Integer
Dim Var As Boolean
Dim SVarRelStartLoc As Double
Dim SVarTotalLength As Double
Dim returnValue As Integer
returnValue = instance.GetProperty(Name,
	PropName, ObjType, Var, SVarRelStartLoc,
	SVarTotalLength)
int GetProperty(
	String^ Name,
	String^% PropName,
	int% ObjType,
	bool% Var,
	double% SVarRelStartLoc,
	double% SVarTotalLength
)
abstract GetProperty :
        Name : string *
        PropName : string byref *
        ObjType : int byref *
        Var : bool byref *
        SVarRelStartLoc : float byref *
        SVarTotalLength : float byref -> int
Parameters
Name
Type: System.String
PropName
Type: System.String
ObjType
Type: System.Int32
Var
Type: System.Boolean
SVarRelStartLoc
Type: System.Double
SVarTotalLength
Type: System.Double
Return Value
Type: Int32
See Also
Reference
cLineElm Interface
ETABSv1 Namespace